# Введение в программу пошагово, как я с ней познакомился через мануал.

## Сначала инициализируем папку, командой "git init"
Как я понял этой командой просто добавляем репозиторий, в котором будуд храниться рабочие файлы и вся информация по ним.

## Работа с файлами

###

При создании файл не отслеживается. Чтобы файл вошёл в систему контроля версий, его нужно подготовить, то есть проиндексировать:
 * git add "название файла"

После этой команды мы можем создать коммит, то есть зафиксировать файл:
 * git commit -m "Мой коммит инициализации будет отсюда"
    * ещё можно использовать -a вместо -m, что бы коммитить без индексации, но тогода коммитятся все файлы в папке 
 
Получается, что файл может быть в 3х состояниях: 
1. когда о нём знает система, но не следит за его состоянием или статусом, или фаил изменён, или файл только открыли пепел внесением изменений, что одно и тоже для gitа (Untracked or unmodified or modified);
2. когда он готов к коммиту, то есть он проиндексирован после команды git add (staged);
    * важно, что если на этом этапе внести изменения и потом закоммитить, то закомиттится без изменений, внесённых после индексации
3. когда фаил закоммичен, то есть зафиксирована версия файла (unmodified);

### Определение статуса
Используемая команда для этого - git status

    On branch master - указана ветка, с которой мы выполнили команду

    Changes not staged for commit: - указывает на то, что изменения не подготовленны к коммиту, то  есть не проиндексированы.

      (use "git add <file>..." to update what will be committed) - предлагает какой командой проиндексировать

      (use "git restore <file>..." to discard changes in working directory) - предлагает отменить изменения и вернуться к закоммиченной версии

        modified:   "\320\224\320\227.md" - из за неудачного названия скорее всего показывает какой файл сейчас изменён и путь до него.

    no changes added to commit (use "git add" and/or "git commit -a") - указывает на отсутвите файлов готовых к коммиту и предлагает либо проиндексировать, либо закоммитеть все файлы папки

Есть команда позволяющая выводить не такую развернутую характеристику состояния файлов 
* git status -s or git status --short


Команду git diff позже разберу)
Нашёл ещё команду для переименования, так как немного не попал с названием git mv настоящееИмя будущееИмя 


## Создание и работа с ветками (branch)
После переименования)
